In [1]:
# Creating DataFrames
# a) PySpark DataFrame From an Existing RDD
import pyspark
import findspark
findspark.init()
from pyspark import SparkContext
from pyspark.sql import SparkSession
sc = SparkContext.getOrCreate()
spark = SparkSession.builder.appName('PySpark DataFrame From RDD').getOrCreate()
rdd = sc.parallelize([('C',85,76,87,91), ('B',85,76,87,91), ("A", 85,78,96,92), ("A", 92,76,89,96)], 4)
print(type(rdd))
sub = ['Division','English','Mathematics','Physics','Chemistry']
marks_df = spark.createDataFrame(rdd, schema=sub)
print(type(marks_df))
marks_df.printSchema()
marks_df.show()

<class 'pyspark.rdd.RDD'>
<class 'pyspark.sql.dataframe.DataFrame'>
root
 |-- Division: string (nullable = true)
 |-- English: long (nullable = true)
 |-- Mathematics: long (nullable = true)
 |-- Physics: long (nullable = true)
 |-- Chemistry: long (nullable = true)

+--------+-------+-----------+-------+---------+
|Division|English|Mathematics|Physics|Chemistry|
+--------+-------+-----------+-------+---------+
|       C|     85|         76|     87|       91|
|       B|     85|         76|     87|       91|
|       A|     85|         78|     96|       92|
|       A|     92|         76|     89|       96|
+--------+-------+-----------+-------+---------+

In [2]:
# b) PySpark DataFrame From an External File
from pyspark.sql import SparkSession
#Creating Spark Session
spark = SparkSession.builder.appName('PySpark DataFrame From External Files').getOrCreate()

In [6]:
#1. Reading a CSV File
df1 = spark.read.csv('C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\Example-1.csv', sep = ',', inferSchema = True, header = True)
df1.show()
print(type(df1))
df1.printSchema()

+---+------+---+------+
| ID|  Name|Age|Salary|
+---+------+---+------+
|  1|  Sona| 12| 12000|
|  2|  Mona| 21| 43000|
|  3| Bannu| 13| 25000|
|  4|Chinnu| 23| 10000|
|  5| sunny| 14| 23000|
|  6|  raju| 24| 78000|
|  7|   ram| 15| 45000|
|  8| lucky| 25| 50000|
|  9|  Appy| 17| 60000|
| 10| Lekha| 38| 21890|
| 11|Vinnni| 11| 78654|
| 12| pavan| 19| 34567|
| 13|  Sita| 32| 78901|
| 14| latha| 33| 56455|
| 15|  Gita| 28| 25678|
+---+------+---+------+

<class 'pyspark.sql.dataframe.DataFrame'>
root
 |-- ID: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [7]:
# 2) Reading from txt file
df=spark.read.text("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\app.txt")
df.show()
df.printSchema()
print(type(df))

+--------------------+
|               value|
+--------------------+
|I am Sriganga.I a...|
+--------------------+

root
 |-- value: string (nullable = true)

<class 'pyspark.sql.dataframe.DataFrame'>

In [8]:
# 3) Reading from JSON file
df = spark.read.json("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\teacher.json", multiLine=True)
df.show()
df.printSchema()
print(type(df))

+-----+----+-----------+--------+
|t_age|t_id|     t_name|t_salary|
+-----+----+-----------+--------+
|   43| 200|Dhana Laxmi|   45000|
+-----+----+-----------+--------+

root
 |-- t_age: long (nullable = true)
 |-- t_id: long (nullable = true)
 |-- t_name: string (nullable = true)
 |-- t_salary: long (nullable = true)

<class 'pyspark.sql.dataframe.DataFrame'>

In [9]:
# c) Additional Methods
#PySpark DataFrame to Pandas DataFrame
# using dataframe created from csv file
df1 = spark.read.csv('C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\Example-1.csv', sep = ',', inferSchema = True, header = True)
df2=df1.toPandas()
df2

    ID    Name  Age  Salary
0    1    Sona   12   12000
1    2    Mona   21   43000
2    3   Bannu   13   25000
3    4  Chinnu   23   10000
4    5   sunny   14   23000
5    6    raju   24   78000
6    7     ram   15   45000
7    8   lucky   25   50000
8    9    Appy   17   60000
9   10   Lekha   38   21890
10  11  Vinnni   11   78654
11  12   pavan   19   34567
12  13    Sita   32   78901
13  14   latha   33   56455
14  15    Gita   28   25678

In [11]:
# Reading multiple files at once
files=["C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\app.txt","C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\student.txt"]
df=spark.read.text(files)
df.show()

+--------------------+
|               value|
+--------------------+
|I am Sriganga.I a...|
|   Name: Shivathmika|
|             Age: 20|
|            Marks:89|
|            Grade: A|
+--------------------+